##не понял как для этой задачи сделать схему алгоритма. или неправильно понял задачу.

print("логические побитовые операции «И» над числами 5 и 6 = ", 5 & 6)
print("логические побитовые операции «ИЛИ» над числами 5 и 6 = ", 5 | 6)
print("логические побитовые операции «исключающее ИЛИ» над числами 5 и 6 = ", 5 ^ 6)
print("логические побитовые операции «НЕ» над числами 5 = ", ~5)
print("побитовый сдвиг числа 5 на 2 знака вправо, 5 >> 2 = ", 5 >> 2, "  и влево 5 << 2 =  ", 5 << 2) #сдвинули 0b101 сначала вправо на два бита = 0b001 = 1(десятич),
                                                                                                      #  или влево  0b10100 = 20(десятичной)

                                                                                                      
